[
    {
        "image": "https://i.imgur.com/1zX2Y3n.jpg",
        "title": "Stranger Things",
        "description": "A group of kids in a small town encounter strange phenomena",
        "director": "The Duffer Brothers",
        "yearStart": 2016,
        "yearEnd": -1,
        "numEpisodes": 25,
        "seasons": [
            {
                "season": 1,
                "episodes": [
                    {
                        "title": "The Vanishing of Will Byers",
                        "description": "On his way home from a friend's house, young Will sees something terrifying. Nearby, a sinister secret lurks in the depths of a government lab.",
                        "duration": 48
                    },
                    {
                        "title": "The Weirdo on Maple Street",
                        "description": "As the town searches for a missing boy, a group of friends discovers a girl with telekinetic powers.",
                        "duration": 55
                    },
                    {
                        "title": "Holly, Jolly",
                        "description": "A mother's search for her missing son leads to a series of mysteries and supernatural occurrences in the town.",
                        "duration": 51
                    },
                    {
                        "title": "The Body",
                        "description": "The friends uncover a shocking truth about the missing boy as they confront a terrifying creature from another dimension.",
                        "duration": 51
                    },
                    {
                        "title": "The Flea and the Acrobat",
                        "description": "A girl with telekinetic abilities joins the group as they face new challenges and a dangerous government conspiracy.",
                        "duration": 52
                    },
                    {
                        "title": "The Monster",
                        "description": "The group battles a monstrous creature, and secrets about the government lab and the missing boy are revealed.",
                        "duration": 48
                    },
                    {
                        "title": "The Bathtub",
                        "description": "The friends embark on a mission to rescue their friend from the parallel dimension, encountering new dangers and allies.",
                        "duration": 42
                    },
                    {
                        "title": "The Upside Down",
                        "description": "The group faces a final showdown with the otherworldly threat as they try to save their friend and unravel the mysteries.",
                        "duration": 55
                    }
                ]
            },
            {
                "season": 2,
                "episodes": [
                    {
                        "title": "MADMAX",
                        "description": "The town is shaken by the arrival of a new girl with a troubled past as the group faces a new threat.",
                        "duration": 48
                    },
                    {
                        "title": "Trick or Treat, Freak",
                        "description": "On Halloween night, the group faces a series of challenges and encounters a mysterious figure from Eleven's past.",
                        "duration": 55
                    },
                    {
                        "title": "The Pollywog",
                        "description": "A strange creature appears, leading the group on a mission to protect their town and uncover a dark secret.",
                        "duration": 51
                    },
                    {
                        "title": "Will the Wise",
                        "description": "Will experiences strange visions, and the group uncovers a connection between the new threat and the parallel dimension.",
                        "duration": 51
                    },
                    {
                        "title": "Dig Dug",
                        "description": "The group goes on a perilous journey to rescue their friend and confront the mysteries of the underground tunnels.",
                        "duration": 52
                    },
                    {
                        "title": "The Spy",
                        "description": "As tensions rise, secrets are revealed, and the group faces betrayals that threaten to tear them apart.",
                        "duration": 48
                    },
                    {
                        "title": "The Lost Sister",
                        "description": "Eleven goes on a personal journey, encountering a gang of misfits with supernatural abilities.",
                        "duration": 42
                    },
                    {
                        "title": "The Mind Flayer",
                        "description": "The group confronts a powerful enemy as the supernatural threat intensifies, putting the town in grave danger.",
                        "duration": 55
                    },
                    {
                        "title": "The Gate",
                        "description": "In a final battle, the group faces the source of the supernatural threat and fights to save their town.",
                        "duration": 55
                    }
                ]
            },
            {
                "season": 3,
                "episodes": [
                    {
                        "title": "Suzie, Do You Copy?",
                        "description": "As the town celebrates the Fourth of July, a new threat emerges, and the group faces challenges on multiple fronts.",
                        "duration": 48
                    },
                    {
                        "title": "The Mall Rats",
                        "description": "The group investigates strange occurrences at the new mall, uncovering a conspiracy that goes beyond their imagination.",
                        "duration": 55
                    },
                    {
                        "title": "The Case of the Missing Lifeguard",
                        "description": "The search for a missing lifeguard leads the group to a sinister plot involving mind control and secret experiments.",
                        "duration": 51
                    },
                    {
                        "title": "The Sauna Test",
                        "description": "As tensions rise, the group faces a deadly challenge, and the true nature of the supernatural threat is revealed.",
                        "duration": 51
                    },
                    {
                        "title": "The Flayed",
                        "description": "The group discovers a disturbing connection between the supernatural threat and the townspeople, leading to a race against time.",
                        "duration": 52
                    },
                    {
                        "title": "E Pluribus Unum",
                        "description": "As the supernatural threat escalates, the group confronts a mind-bending reality and fights for the survival of their town.",
                        "duration": 48
                    },
                    {
                        "title": "The Bite",
                        "description": "The group faces personal and collective challenges as the supernatural threat reaches a critical point, and sacrifices are made.",
                        "duration": 42
                    },
                    {
                        "title": "The Battle of Starcourt",
                        "description": "In a climactic battle, the group confronts the supernatural threat, and the fate of the town hangs in the balance.",
                        "duration": 55
                    }
                ]
            },
            {
                "season": 4,
                "episodes": [
                    {
                        "title": "The Hellfire Club",
                        "description": "A new mystery unfolds as the group encounters a secret society and delves into the dark history of their town.",
                        "duration": 48
                    },
                    {
                        "title": "Tick Tok Mr. Clock",
                        "description": "Time is of the essence as the group races against a ticking clock to unravel a conspiracy and save their town.",
                        "duration": 55
                    },
                    {
                        "title": "You Snooze You Lose",
                        "description": "The group faces unexpected challenges and must navigate a dangerous game that puts their lives on the line.",
                        "duration": 51
                    },
                    {
                        "title": "The Body Snatchers",
                        "description": "A chilling discovery leads the group to confront a threat that takes on a horrifying new form.",
                        "duration": 51
                    },
                    {
                        "title": "The Great Escape",
                        "description": "As the group plans a daring escape, they uncover shocking truths and face betrayals that test their loyalty.",
                        "duration": 52
                    },
                    {
                        "title": "The Dive",
                        "description": "The group dives into the unknown, facing perilous challenges and discovering secrets that change everything.",
                        "duration": 48
                    },
                    {
                        "title": "The Lost Sister",
                        "description": "Old and new allies emerge as the group faces a formidable foe, and the past comes back to haunt them.",
                        "duration": 42
                    },
                    {
                        "title": "The Mind Flayer",
                        "description": "The supernatural threat reaches its peak, and the group must confront the true nature of the enemy to save their town.",
                        "duration": 55
                    },
                    {
                        "title": "The Gate",
                        "description": "In a final showdown, the group battles the supernatural forces to close the gate and secure the safety of their town.",
                        "duration": 55
                    }
                ]
            }
        ],
        "cast": [
            "Millie Bobby Brown",
            "Finn Wolfhard"
        ],
        "genre": [
            "Sci-Fi",
            "Horror"
        ],
        "durationAVG": 0,
        "rating": 4.7,
        "platform": [
            "Netflix"
        ]
    },
    {
        "image": "https://i.imgur.com/1zX2Y3n.jpg",
        "title": "La Casa de Papel",
        "description": "A group of criminals plans and executes the perfect heist on the Royal Mint of Spain.",
        "director": "Álex Pina",
        "yearStart": 2017,
        "yearEnd": -1,
        "numEpisodes": 31,
        "seasons": [
            {
                "season": 1,
                "episodes": [
                    {
                        "title": "Do as Planned",
                        "description": "The Professor recruits eight criminals to carry out the plan to rob the Royal Mint.",
                        "duration": 47
                    },
                    {
                        "title": "Lethal Negligence",
                        "description": "The heist is underway, but mistakes and unforeseen events put the plan at risk.",
                        "duration": 41
                    },
                    {
                        "title": "Mistakes",
                        "description": "Tensions rise as the criminals face unexpected challenges during the heist.",
                        "duration": 51
                    },
                    {
                        "title": "Trojan Horse",
                        "description": "The Professor's intricate plan faces new threats as the heist progresses.",
                        "duration": 48
                    },
                    {
                        "title": "Groundhog Day",
                        "description": "Repeating challenges test the robbers' resolve as they try to maintain control.",
                        "duration": 43
                    },
                    {
                        "title": "Warm Cold War",
                        "description": "Internal conflicts and external pressures complicate the already complex situation.",
                        "duration": 48
                    },
                    {
                        "title": "Cool Instability",
                        "description": "The heist faces a critical turning point with unexpected consequences.",
                        "duration": 44
                    },
                    {
                        "title": "You're Insane",
                        "description": "The situation becomes increasingly dire as the Professor's plan is pushed to the limit.",
                        "duration": 51
                    }
                ]
            },
            {
                "season": 2,
                "episodes": [
                    {
                        "title": "A New Reality",
                        "description": "The aftermath of the first heist forces the Professor and his team to adapt to a changed reality.",
                        "duration": 47
                    },
                    {
                        "title": "The Head of the Plan",
                        "description": "New challenges and unexpected alliances emerge as the Professor faces formidable adversaries.",
                        "duration": 45
                    },
                    {
                        "title": "Rats",
                        "description": "Internal and external threats escalate, putting the heist and the Professor's plan at risk.",
                        "duration": 44
                    },
                    {
                        "title": "Boom, Boom, Ciao",
                        "description": "The heist reaches a critical moment as the Professor and his team confront their toughest challenges.",
                        "duration": 55
                    },
                    {
                        "title": "Red Boxes",
                        "description": "The Professor's strategies are put to the test, leading to unexpected twists and turns.",
                        "duration": 46
                    },
                    {
                        "title": "Everything Seemed Insignificant",
                        "description": "As the heist intensifies, personal relationships and loyalties are strained to the breaking point.",
                        "duration": 53
                    },
                    {
                        "title": "Subdued Astronomy",
                        "description": "The Professor and his team face internal and external pressures as they navigate a complex web of challenges.",
                        "duration": 50
                    },
                    {
                        "title": "The Drift",
                        "description": "The heist reaches its climax, with the Professor and his team facing the consequences of their actions.",
                        "duration": 51
                    }
                ]
            },
            {
                "season": 3,
                "episodes": [
                    {
                        "title": "We're Back",
                        "description": "The Professor reunites the team for a new heist, but old and new enemies complicate the plan.",
                        "duration": 49
                    },
                    {
                        "title": "Aikido",
                        "description": "The heist faces unexpected challenges, testing the team's unity and resolve.",
                        "duration": 43
                    },
                    {
                        "title": "48 Meters Underground",
                        "description": "As the heist progresses, the Professor and his team confront unforeseen obstacles and betrayals.",
                        "duration": 45
                    },
                    {
                        "title": "The Perfect Crime",
                        "description": "Tensions rise as the Professor's plan encounters unexpected complications and personal conflicts.",
                        "duration": 48
                    },
                    {
                        "title": "Berlin's Wedding",
                        "description": "Flashbacks reveal key events as the Professor and his team grapple with emotional and strategic challenges.",
                        "duration": 47
                    },
                    {
                        "title": "Everything Seemed Insignificant",
                        "description": "The heist reaches a critical juncture with new alliances, betrayals, and high-stakes decisions.",
                        "duration": 49
                    },
                    {
                        "title": "Little Vacations",
                        "description": "The Professor and his team face escalating threats and internal conflicts as the heist unfolds.",
                        "duration": 47
                    },
                    {
                        "title": "The Fly",
                        "description": "As the heist nears its climax, the Professor and his team confront the consequences of their actions.",
                        "duration": 47
                    }
                ]
            },
            {
                "season": 4,
                "episodes": [
                    {
                        "title": "Game Over",
                        "description": "The Professor and his team face their toughest challenge yet as old and new enemies close in.",
                        "duration": 57
                    },
                    {
                        "title": "Tokyo's Wedding",
                        "description": "Flashbacks and present-day events reveal key moments in the characters' lives as the heist reaches a climax.",
                        "duration": 52
                    },
                    {
                        "title": "Anatomy Lesson",
                        "description": "The Professor and his team confront personal and strategic challenges with the heist on the line.",
                        "duration": 48
                    },
                    {
                        "title": "Spain's Breath",
                        "description": "The heist faces unexpected twists and betrayals, pushing the Professor and his team to their limits.",
                        "duration": 55
                    },
                    {
                        "title": "5 Minutes Earlier",
                        "description": "As the heist approaches its conclusion, the Professor and his team confront the fallout of their choices.",
                        "duration": 48
                    },
                    {
                        "title": "TKO",
                        "description": "The Professor and his team face their final challenges as the heist reaches its epic conclusion.",
                        "duration": 53
                    },
                    {
                        "title": "Strike the Tent",
                        "description": "The aftermath of the heist reveals the fates of the characters as they come to terms with the consequences.",
                        "duration": 55
                    },
                    {
                        "title": "Paris Plan",
                        "description": "Flashbacks and present-day events intertwine as the Professor and his team navigate the aftermath of the heist.",
                        "duration": 54
                    }
                ]
            }
        ],
        "cast": [
            "Úrsula Corberó",
            "Álvaro Morte"
        ],
        "genre": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "durationAVG": 0,
        "rating": 4.8,
        "platform": [
            "Netflix"
        ]
    },
    {
        "image": "https://i.imgur.com/1zX2Y3n.jpg",
        "title": "The Mandalorian",
        "description": "A lone gunfighter makes his way through the outer reaches of the galaxy, far from the authority of the New Republic.",
        "director": "Jon Favreau",
        "yearStart": 2019,
        "yearEnd": -1,
        "numEpisodes": 16,
        "seasons": [
            {
                "season": 1,
                "episodes": [
                    {
                        "title": "The Mandalorian",
                        "description": "A Mandalorian bounty hunter tracks a target for a well-paying client.",
                        "duration": 39
                    },
                    {
                        "title": "The Child",
                        "description": "Target in-hand, the Mandalorian must now contend with scavengers.",
                        "duration": 32
                    },
                    {
                        "title": "The Sin",
                        "description": "The battered Mandalorian returns to his client for reward.",
                        "duration": 38
                    },
                    {
                        "title": "Sanctuary",
                        "description": "The Mandalorian teams up with an ex-soldier to protect a farming village.",
                        "duration": 41
                    },
                    {
                        "title": "The Gunslinger",
                        "description": "The Mandalorian helps a rookie bounty hunter who is in over his head.",
                        "duration": 35
                    },
                    {
                        "title": "The Prisoner",
                        "description": "The Mandalorian joins a crew of mercenaries on a dangerous mission.",
                        "duration": 41
                    },
                    {
                        "title": "The Reckoning",
                        "description": "An old rival extends an invitation for the Mandalorian to make peace.",
                        "duration": 48
                    },
                    {
                        "title": "Redemption",
                        "description": "The Mandalorian comes face-to-face with an unexpected enemy.",
                        "duration": 48
                    }
                ]
            },
            {
                "season": 2,
                "episodes": [
                    {
                        "title": "The Marshal",
                        "description": "The Mandalorian is drawn to the Outer Rim in search of others of his kind.",
                        "duration": 52
                    },
                    {
                        "title": "The Passenger",
                        "description": "The Mandalorian must ferry a passenger with precious cargo on a risky journey.",
                        "duration": 41
                    },
                    {
                        "title": "The Heiress",
                        "description": "The Mandalorian braves high seas and meets unexpected allies.",
                        "duration": 35
                    },
                    {
                        "title": "The Siege",
                        "description": "The Mandalorian rejoins old allies for a new mission.",
                        "duration": 38
                    },
                    {
                        "title": "The Jedi",
                        "description": "The Mandalorian journeys to a world ruled by a cruel magistrate who has made a powerful enemy.",
                        "duration": 47
                    },
                    {
                        "title": "The Tragedy",
                        "description": "The Mandalorian and Child travel to an ancient site.",
                        "duration": 35
                    },
                    {
                        "title": "The Believer",
                        "description": "To move against the Empire, the Mandalorian needs the help of an old enemy.",
                        "duration": 38
                    },
                    {
                        "title": "The Rescue",
                        "description": "The Mandalorian and his allies attempt a daring rescue.",
                        "duration": 47
                    }
                ]
            },
            {
                "season": 3,
                "episodes": [
                   {
                    "title": "The Apostate",
                    "description": "The Mandalorian starts and important voyage",
                    "duration": 52
                   },
                   {
                    "title": "The Mines of Mandalore",
                    "description": "The Mandalorian and Grogu explore the ruins of a destroyed planet",
                    "duration": 38
                   },
                   {
                    "title": "The Convert",
                    "description": "The Convert",
                    "duration": 40
                   },
                   {
                    "title": "The Foundling",
                    "description": "Din Djarin comes back to the secret mandalorian site",
                    "duration": 35
                   },
                   {
                    "title": "The Pirate",
                    "description": "Nevarro residents need help fending off a fierce pirate attack",
                    "duration": 36
                   },
                   {
                    "title": "Guns of Hire",
                    "description": "The Mandalorian visits an opulent world",
                    "duration": 32
                   },
                   {
                    "title": "The Spies",
                    "description": "Survivors come out of hiding",
                    "duration": 42
                   },
                   {
                    "title": "The Return",
                    "description": "Din Djarin and his allies face off against the enemy",
                    "duration": 48
                   }
                ]
            }
        ],
        "cast": [
            "Pedro Pascal",
            "Gina Carano"
        ],
        "genre": [
            "Action",
            "Adventure",
            "Sci-Fi"
        ],
        "durationAVG": 0,
        "rating": 4.9,
        "platform": [
            "Disney+"
        ]
    },
    {
        "image": "https://i.imgur.com/xyz123.jpg",
        "title": "Breaking Bad",
        "description": "A high school chemistry teacher turned methamphetamine manufacturer navigates the dangerous world of drugs and crime.",
        "director": "Vince Gilligan",
        "yearStart": 2008,
        "yearEnd": 2013,
        "numEpisodes": 62,
        "seasons": [
            {
                "season": 1,
                "episodes": [
                    {
                        "title": "Pilot",
                        "description": "High school chemistry teacher Walter White is diagnosed with terminal lung cancer. In a desperate bid to secure his family's financial future, he turns to a life of crime.",
                        "duration": 58
                    },
                    {
                        "title": "Cat's in the Bag...",
                        "description": "Walter and Jesse try to dispose of the two bodies in the RV, and Skyler suspects that Walter is hiding something.",
                        "duration": 48
                    },
                    {
                        "title": "...And the Bag's in the River",
                        "description": "Walter fights with Jesse over their expanded drug operation. Skyler's plans to open a car wash take an unexpected turn.",
                        "duration": 47
                    },
                    {
                        "title": "Cancer Man",
                        "description": "Walter finally tells his family about his cancer. Meanwhile, Skyler is planning her sister's baby shower.",
                        "duration": 48
                    },
                    {
                        "title": "Gray Matter",
                        "description": "Walter and Jesse adjust to life out of the business, while Hank struggles with his recovery. Saul offers Walt a solution to his money troubles.",
                        "duration": 48
                    },
                    {
                        "title": "Crazy Handful of Nothin'",
                        "description": "Walter accepts his new identity as a drug dealer after a PTA meeting. Jesse decides to put his aunt's house on the market.",
                        "duration": 48
                    },
                    {
                        "title": "A No-Rough-Stuff-Type Deal",
                        "description": "Walter and Jesse try to produce a large quantity of meth for Tuco. Skyler confronts Walter about his actions, and Hank fights to keep Jesse in custody.",
                        "duration": 48
                    }
                ]
            },
            {
                "season": 2,
                "episodes": [
                    {
                        "title": "Seven Thirty-Seven",
                        "description": "Walter White's life begins to spiral out of control after his wife's confrontation with Jesse. Skyler's involvement with Ted grows deeper.",
                        "duration": 47
                    },
                    {
                        "title": "Grilled",
                        "description": "Walter fights with Jesse over the secrets he is hiding, and Jesse meets Jane's father. Meanwhile, Skyler grows suspicious of Walter's activities.",
                        "duration": 48
                    },
                    {
                        "title": "Bit by a Dead Bee",
                        "description": "Walter tries to reconnect with his family, but Skyler is suspicious of his actions. Jesse ends up in rehab, and Jane's father seeks revenge.",
                        "duration": 48
                    },
                    {
                        "title": "Down",
                        "description": "Walter and Jesse are held captive by Tuco, and Saul tries to arrange their release. Skyler tries to find out what happened to Walter.",
                        "duration": 48
                    },
                    {
                        "title": "Breakage",
                        "description": "Walter and Jesse face difficulties in expanding their territory. Skyler confronts Walter about his mysterious behavior.",
                        "duration": 48
                    },
                    {
                        "title": "Peekaboo",
                        "description": "Walter and Jesse's distribution plans hit a snag, and Hank continues his investigation. Skyler's relationship with Ted becomes more complicated.",
                        "duration": 48
                    },
                    {
                        "title": "Negro y Azul",
                        "description": "Walter and Jesse's reputation in the meth world grows, attracting attention from law enforcement and rival criminals.",
                        "duration": 48
                    },
                    {
                        "title": "Better Call Saul",
                        "description": "Walter hires a lawyer to help him navigate the legal issues surrounding his meth operation. Jesse goes to rehab, and Skyler grows more suspicious.",
                        "duration": 48
                    },
                    {
                        "title": "4 Days Out",
                        "description": "Walter and Jesse go on a marathon RV cook session, leading to unforeseen consequences. Skyler gets involved in Walter's business.",
                        "duration": 48
                    },
                    {
                        "title": "Over",
                        "description": "Walter and Jesse's business faces new challenges. Skyler makes a surprising discovery, and Jane's addiction takes a dark turn.",
                        "duration": 48
                    },
                    {
                        "title": "Mandala",
                        "description": "Walter and Jesse's operation expands, leading to new challenges. Skyler confronts Walter about his criminal activities.",
                        "duration": 48
                    },
                    {
                        "title": "Phoenix",
                        "description": "Walter and Jesse's business enters a new phase. Skyler's relationship with Ted intensifies, and Jesse deals with grief.",
                        "duration": 48
                    },
                    {
                        "title": "ABQ",
                        "description": "Jane's death has a profound impact on Jesse. Walter's secret activities begin to unravel, leading to a tragic plane crash.",
                        "duration": 48
                    }
                ]
            },
            {
                "season": 3,
                "episodes": [
                    {
                        "title": "No Mas",
                        "description": "Walter and Jesse face the consequences of the airplane crash, and Skyler confronts Walter about his criminal activities.",
                        "duration": 47
                    },
                    {
                        "title": "Caballo Sin Nombre",
                        "description": "Walter considers a new job opportunity, and Jesse struggles with guilt. Skyler and Walter's marriage reaches a breaking point.",
                        "duration": 47
                    },
                    {
                        "title": "I.F.T.",
                        "description": "Skyler kicks Walter out of the house, and Jesse gets involved with Jane's father. Walter continues his descent into the drug trade.",
                        "duration": 47
                    },
                    {
                        "title": "Green Light",
                        "description": "Walter and Jesse's partnership faces new challenges. Skyler is drawn deeper into Walter's world.",
                        "duration": 47
                    },
                    {
                        "title": "Mas",
                        "description": "Walter and Jesse's operation faces a threat, and Hank's investigation intensifies. Skyler considers her options.",
                        "duration": 47
                    },
                    {
                        "title": "Sunset",
                        "description": "Walter and Jesse's alliance with Gus Fring grows, leading to new opportunities and dangers.",
                        "duration": 47
                    },
                    {
                        "title": "One Minute",
                        "description": "Hank faces a life-threatening situation, and Jesse confronts the consequences of his actions.",
                        "duration": 47
                    },
                    {
                        "title": "I See You",
                        "description": "Walter and Jesse deal with the aftermath of the Cousins' attack, and Skyler grows suspicious of Walter's activities.",
                        "duration": 47
                    },
                    {
                        "title": "Kafkaesque",
                        "description": "Walter and Jesse face challenges from all sides. Skyler becomes more involved in Walt's business.",
                        "duration": 47
                    },
                    {
                        "title": "Fly",
                        "description": "Walter becomes obsessed with a fly in the lab, leading to tension between him and Jesse.",
                        "duration": 47
                    },
                    {
                        "title": "Abiquiu",
                        "description": "Jesse wrestles with guilt, and Walter's relationship with Gus becomes more complicated.",
                        "duration": 47
                    },
                    {
                        "title": "Half Measures",
                        "description": "Walter takes drastic action to protect Jesse, leading to dire consequences. Skyler's involvement in Walter's business deepens.",
                        "duration": 47
                    },
                    {
                        "title": "Full Measure",
                        "description": "Walter faces a deadly ultimatum, and Jesse takes matters into his own hands.",
                        "duration": 47
                    }
                ]
            },
            {
                "season": 4,
                "episodes": [
                    {
                        "title": "Box Cutter",
                        "description": "Walter and Jesse's relationship with Gus becomes increasingly tense, leading to a shocking act of violence.",
                        "duration": 47
                    },
                    {
                        "title": "Thirty-Eight Snub",
                        "description": "Walter buys a new gun for protection, and Jesse tries to distance himself from the drug trade.",
                        "duration": 47
                    },
                    {
                        "title": "Open House",
                        "description": "Skyler gets involved in the car wash business, and Walter faces challenges from a new rival.",
                        "duration": 47
                    },
                    {
                        "title": "Bullet Points",
                        "description": "Walter and Skyler attend a birthday party, and Jesse's actions have unforeseen consequences.",
                        "duration": 47
                    },
                    {
                        "title": "Shotgun",
                        "description": "Jesse goes on a road trip with Mike, and Walter faces difficulties in his personal and professional life.",
                        "duration": 47
                    },
                    {
                        "title": "Cornered",
                        "description": "Skyler's involvement in Walter's business becomes more complicated, and Jesse faces a moral dilemma.",
                        "duration": 47
                    },
                    {
                        "title": "Problem Dog",
                        "description": "Jesse seeks therapy, and Walter's actions have repercussions for everyone involved.",
                        "duration": 47
                    },
                    {
                        "title": "Hermanos",
                        "description": "Jesse's relationship with Andrea becomes complicated, and Walter's past actions come back to haunt him.",
                        "duration": 47
                    },
                    {
                        "title": "Bug",
                        "description": "Jesse goes on a downward spiral, and Walter faces challenges from all sides.",
                        "duration": 47
                    },
                    {
                        "title": "Salud",
                        "description": "Walter and Jesse face a dangerous situation in Mexico, and Skyler's involvement in Walter's business deepens.",
                        "duration": 47
                    },
                    {
                        "title": "Crawl Space",
                        "description": "Walter's life takes a dark turn, and Jesse tries to make amends for his past actions.",
                        "duration": 47
                    },
                    {
                        "title": "End Times",
                        "description": "Walter's actions have severe consequences, and Jesse's life is in danger.",
                        "duration": 47
                    },
                    {
                        "title": "Face Off",
                        "description": "Walter and Jesse's conflict with Gus reaches its climax in a deadly showdown.",
                        "duration": 47
                    }
                ]
            },
            {
                "season": 5,
                "episodes": [
                    {
                        "title": "Live Free or Die",
                        "description": "Walter and Jesse face the aftermath of their confrontation with Gus, and Hank begins to piece together the puzzle.",
                        "duration": 47
                    },
                    {
                        "title": "Madrigal",
                        "description": "Walter and Jesse's new business faces challenges, and Hank's investigation intensifies.",
                        "duration": 47
                    },
                    {
                        "title": "Hazard Pay",
                        "description": "Walter and his team navigate the challenges of their new operation, and Skyler grows more suspicious of Walter.",
                        "duration": 47
                    },
                    {
                        "title": "Fifty-One",
                        "description": "Walter celebrates his birthday, and Skyler makes a decision that has far-reaching consequences.",
                        "duration": 47
                    },
                    {
                        "title": "Dead Freight",
                        "description": "Walter and his team plan a dangerous train heist, and Jesse's moral compass is tested.",
                        "duration": 47
                    },
                    {
                        "title": "Buyout",
                        "description": "Walter and his team face the fallout from the train heist, and Jesse makes a life-changing decision.",
                        "duration": 47
                    },
                    {
                        "title": "Say My Name",
                        "description": "Walter and his team confront a new adversary, and Hank inches closer to the truth.",
                        "duration": 47
                    },
                    {
                        "title": "Gliding Over All",
                        "description": "Walter considers leaving the drug trade, and Hank makes a major breakthrough in his investigation.",
                        "duration": 47
                    }
                ]
            }
        ],
        "cast": [
            "Bryan Cranston",
            "Aaron Paul"
        ],
        "genre": [
            "Crime",
            "Drama",
            "Thriller"
        ],
        "durationAVG": 0,
        "rating": 9.5,
        "platform": [
            "Netflix"
        ]
    }
        
]
